{"candidate Profile Description": {"summary": "A highly skilled Computer Science Graduate specializing in Machine Learning, Deep Learning, and Data Mining with excellent analytical and problem-solving skills. Experienced in handling large datasets, developing data warehouses, and creating business intelligence dashboards. Adept at developing, deploying, and optimizing machine learning models. Possesses good expertise in multiple languages and frameworks."}, "personal_info": {"name": "Aryan Shrestha", "contact": {"email": "ashrestha6@student.gsu.edu", "phone": 4708548455, "location": "Atlanta, GA"}, "links": {"LinkedIn": "linkedin.com/in/aryan-shrestha-8200a1236"}}, "education": [{"institution": "Georgia State University", "degree": "M.S. in Computer Science", "GPA": "GPA not specified", "start_date": "Not specified", "end_date": "May 2024", "location": "Atlanta, GA", "relevant_coursework": ["Machine Learning", "Deep Learning", "Data Mining", "Data Science", "Spatial & Scientific Databases"]}, {"institution": "Dr. AIT", "degree": "Bachelor of Engineering, Computer Science", "start_date": "Not specified", "end_date": "Aug 2018", "location": "Bangalore, India"}], "experience": [{"company": "State Road & Tollway Authority", "title": "Data Science Intern", "start_date": "Jun 2023", "end_date": "Aug 2023", "location": "Atlanta, Georgia", "responsibilities": ["Cleaned and analyzed large datasets to identify trends and patterns.", "Developed a data warehouse improving data access and analysis for the marketing team.", "Created a business intelligence dashboard tracking key performance indicators for the sales team.", "Used Tableau to create data visualizations communicating complex findings to non-technical audiences."]}, {"company": "F1Soft International Pvt Ltd", "title": "Machine Learning Researcher, Software Engineer", "start_date": "Sept 2019", "end_date": "Oct 2021", "location": "Kathmandu, Nepal", "responsibilities": ["Built and maintained data pipelines to collect, clean, and prepare data for machine learning models.", "Developed, deployed, and optimized machine learning models to improve accuracy, scalability and reliability.", "Showcased expertise in data mining techniques, statistical analysis, and machine learning algorithms.", "Developed web-based application using java and sql.", "Compiled and accessed user feedback to improve software development."]}, {"company": "Nous InfoSystems", "title": "Software Engineer", "start_date": "Sept 2018", "end_date": "Aug 2019", "location": "Bangalore, India", "responsibilities": ["Performed quality assurance and reported bug issues.", "Developed and automated test cases for software validation.", "Determined scalability and performance of the test software.", "Prepared project requirement documents through interview and meetings."]}], "skills": {"languages": ["Python (pytorch, keras, numpy, pandas, scikit-learn, seaborn, matplotlib, LSTM)", "Java", "R", "SQL", "C/C++"], "tools": ["Jupyter", "Eclipse", "Tableau", "Alteryx", "Oracle", "Selenium", "Jira", "MS-Office", "Photoshop", "WordPress", "GitHub"], "knowledge_areas": ["Data Analytics", "Data Visualization", "Computer Vision", "Image Processing", "Natural Language Processing", "Algorithms", "Model Evaluation", "Predictive Modeling", "Neural Networks", "Software Development", "Manual Testing", "Automation Testing"]}, "projects": [{"name": "Automated Image Caption Generator with LSTM and CNN", "description": "The project creates a model to automatically generate a description of the provided image. The model is based on concepts of CNN, RNN, LSTM along with attention mechanism."}, {"name": "Restaurant Data Analysis", "description": "The project uses advanced data mining techniques to study various factors responsible for the success of a newly start-up restaurant."}, {"name": "Bank Data Analysis", "description": "The project aims to find the attributes in the dataset that can categorize clients based on whether they accept or reject the term deposit using ML models."}, {"name": "Sentiment Analysis on IMDB Reviews", "description": "The main goal of this project is to estimate the sentiment of movie reviews from the Internet Movie Database (IMDb) by combining ML and NLP."}]}
